MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F334J8TI/mcu.h
typedef struct {
    uint32_t                                 RESERVED0[1664];
    stc_hrpwm_capar_bit_t                    CAPAR_b;
    stc_hrpwm_capbr_bit_t                    CAPBR_b;
    uint32_t                                 RESERVED1[832];
    stc_hrpwm_gconr_bit_t                    GCONR_b;
    stc_hrpwm_iconr_bit_t                    ICONR_b;
    stc_hrpwm_bconr1_bit_t                   BCONR1_b;
    stc_hrpwm_dconr_bit_t                    DCONR_b;
    uint32_t                                 RESERVED2[32];
    stc_hrpwm_pcnar1_bit_t                   PCNAR1_b;
    stc_hrpwm_pcnbr1_bit_t                   PCNBR1_b;
    uint32_t                                 RESERVED3[32];
    stc_hrpwm_vperr_bit_t                    VPERR_b;
    stc_hrpwm_stflr1_bit_t                   STFLR1_b;
    stc_hrpwm_stflr2_bit_t                   STFLR2_b;
    uint32_t                                 RESERVED4[160];
    stc_hrpwm_hstar1_bit_t                   HSTAR1_b;
    uint32_t                                 RESERVED5[32];
    stc_hrpwm_hclrr1_bit_t                   HCLRR1_b;
    uint32_t                                 RESERVED6[32];
    stc_hrpwm_hcpar1_bit_t                   HCPAR1_b;
    stc_hrpwm_hcpbr1_bit_t                   HCPBR1_b;
    stc_hrpwm_hcpar2_bit_t                   HCPAR2_b;
    stc_hrpwm_hcpbr2_bit_t                   HCPBR2_b;
    uint32_t                                 RESERVED7[768];
    stc_hrpwm_bconr2_bit_t                   BCONR2_b;
    uint32_t                                 RESERVED8[96];
    stc_hrpwm_hstar2_bit_t                   HSTAR2_b;
    uint32_t                                 RESERVED9[32];
    stc_hrpwm_hclrr2_bit_t                   HCLRR2_b;
    uint32_t                                 RESERVED10[32];
    stc_hrpwm_eefoffsetar_bit_t              EEFOFFSETAR_b;
    stc_hrpwm_eefoffsetbr_bit_t              EEFOFFSETBR_b;
    stc_hrpwm_eefwinar_bit_t                 EEFWINAR_b;
    stc_hrpwm_eefwinbr_bit_t                 EEFWINBR_b;
    stc_hrpwm_eefltcr1_bit_t                 EEFLTCR1_b;
    stc_hrpwm_eefltcr2_bit_t                 EEFLTCR2_b;
    uint32_t                                 RESERVED11[64];
    stc_hrpwm_idlecr_bit_t                   IDLECR_b;
    stc_hrpwm_gconr1_bit_t                   GCONR1_b;
    stc_hrpwm_biconr_bit_t                   BICONR_b;
    stc_hrpwm_bpcnar1_bit_t                  BPCNAR1_b;
    stc_hrpwm_bpcnbr1_bit_t                  BPCNBR1_b;
    uint32_t                                 RESERVED12[128];
    stc_hrpwm_bgconr1_bit_t                  BGCONR1_b;
    stc_hrpwm_scmaselr_bit_t                 SCMASELR_b;
    uint32_t                                 RESERVED13[416];
    stc_hrpwm_cr_bit_t                       CR_b;
    stc_hrpwm_phsctl_bit_t                   PHSCTL_b;
} bCM_HRPWM_TypeDef;

typedef struct {
    uint32_t                                 RESERVED0[96];
    stc_hrpwm_common_calcr_bit_t             CALCR_b;
    uint32_t                                 RESERVED1[1248];
    stc_hrpwm_common_scapr_bit_t             SCAPR_b;
    stc_hrpwm_common_sstaidlr_bit_t          SSTAIDLR_b;
    stc_hrpwm_common_sstarunr1_bit_t         SSTARUNR1_b;
    stc_hrpwm_common_sstarunr2_bit_t         SSTARUNR2_b;
    stc_hrpwm_common_sstadidlr_bit_t         SSTADIDLR_b;
    stc_hrpwm_common_gctlr_bit_t             GCTLR_b;
    stc_hrpwm_common_gbconr_bit_t            GBCONR_b;
    stc_hrpwm_common_gbsflr_bit_t            GBSFLR_b;
    stc_hrpwm_common_bmcr_bit_t              BMCR_b;
    stc_hrpwm_common_bmstrg1_bit_t           BMSTRG1_b;
    stc_hrpwm_common_bmstrg2_bit_t           BMSTRG2_b;
    uint32_t                                 RESERVED2[128];
    stc_hrpwm_common_eecr1_bit_t             EECR1_b;
    stc_hrpwm_common_eecr2_bit_t             EECR2_b;
    uint32_t                                 RESERVED3[32];
    stc_hrpwm_common_synocr_bit_t            SYNOCR_b;
    stc_hrpwm_common_eedselr_bit_t           EEDSELR_b;
    stc_hrpwm_common_fcntr_bit_t             FCNTR_b;
    stc_hrpwm_common_sstar_bit_t             SSTAR_b;
    stc_hrpwm_common_sstpr_bit_t             SSTPR_b;
    stc_hrpwm_common_sclrr_bit_t             SCLRR_b;
    stc_hrpwm_common_supdr_bit_t             SUPDR_b;
} bCM_HRPWM_COMMON_TypeDef;

typedef struct {
    stc_i2c_cr1_bit_t                        CR1_b;
    stc_i2c_cr2_bit_t                        CR2_b;
    stc_i2c_cr3_bit_t                        CR3_b;
    stc_i2c_cr4_bit_t                        CR4_b;
    stc_i2c_slr0_bit_t                       SLR0_b;
    stc_i2c_slr1_bit_t                       SLR1_b;
    uint32_t                                 RESERVED0[32];
    stc_i2c_sr_bit_t                         SR_b;
    stc_i2c_clr_bit_t                        CLR_b;
    uint32_t                                 RESERVED1[64];
    stc_i2c_ccr_bit_t                        CCR_b;
    stc_i2c_fltr_bit_t                       FLTR_b;
    stc_i2c_fstr_bit_t                       FSTR_b;
} bCM_I2C_TypeDef;

typedef struct {
    stc_icg_icg0_bit_t                       ICG0_b;
    stc_icg_icg1_bit_t                       ICG1_b;
} bCM_ICG_TypeDef;

typedef struct {
    uint32_t                                 RESERVED0[32];
    stc_intc_nmier_bit_t                     NMIER_b;
    stc_intc_nmifr_bit_t                     NMIFR_b;
    stc_intc_nmifcr_bit_t                    NMIFCR_b;
    stc_intc_eirqcr_bit_t                    EIRQCR0_b;
    stc_intc_eirqcr_bit_t                    EIRQCR1_b;
    stc_intc_eirqcr_bit_t                    EIRQCR2_b;
    stc_intc_eirqcr_bit_t                    EIRQCR3_b;
    stc_intc_eirqcr_bit_t                    EIRQCR4_b;
    stc_intc_eirqcr_bit_t                    EIRQCR5_b;
    stc_intc_eirqcr_bit_t                    EIRQCR6_b;
    stc_intc_eirqcr_bit_t                    EIRQCR7_b;
    stc_intc_eirqcr_bit_t                    EIRQCR8_b;
    stc_intc_eirqcr_bit_t                    EIRQCR9_b;
    stc_intc_eirqcr_bit_t                    EIRQCR10_b;
    stc_intc_eirqcr_bit_t                    EIRQCR11_b;
    stc_intc_eirqcr_bit_t                    EIRQCR12_b;
    stc_intc_eirqcr_bit_t                    EIRQCR13_b;
    stc_intc_eirqcr_bit_t                    EIRQCR14_b;
    stc_intc_eirqcr_bit_t                    EIRQCR15_b;
    stc_intc_wken_bit_t                      WKEN_b;
    stc_intc_eifr_bit_t                      EIFR_b;
    stc_intc_eifcr_bit_t                     EIFCR_b;
    uint32_t                                 RESERVED1[4608];
    stc_intc_swier_bit_t                     SWIER_b;
    stc_intc_evter_bit_t                     EVTER_b;
    stc_intc_ier_bit_t                       IER_b;
    stc_intc_fpuier_bit_t                    FPUIER_b;
} bCM_INTC_TypeDef;

